{
    "summary": "The comments discuss Minecraft AI model training, reinforcement learning features, and limited resource data collection for the MineRL BASALT 2022 competition, as well as building a house in under 10 minutes without harming villages.",
    "details": [
        {
            "comment": "This code provides instructions for setting up and running the Video PreTraining (VPT) model, which learns to act by watching unlabeled online videos. It also includes a link to the paper describing the methodology and provides information on where to find more resources related to VPT. The code includes commands to install pre-requisites, requirements, and run the agent models. Additionally, it lists various pre-trained Minecraft models with their respective model files and weights.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":2-34",
            "content": "# Video-Pre-Training\nVideo PreTraining (VPT): Learning to Act by Watching Unlabeled Online Videos\n> :page_facing_up: [Read Paper](https://cdn.openai.com/vpt/Paper.pdf) \\\n  :mega: [Blog Post](https://openai.com/blog/vpt) \\\n  :space_invader: [MineRL Environment](https://github.com/minerllabs/minerl) (note version 1.0+ required) \\\n  :checkered_flag: [MineRL BASALT Competition](https://www.aicrowd.com/challenges/neurips-2022-minerl-basalt-competition)\n# Running agent models\nInstall pre-requirements for [MineRL](https://minerl.readthedocs.io/en/latest/tutorials/index.html).\nThen install requirements with:\n```\npip install git+https://github.com/minerllabs/minerl\npip install -r requirements.txt\n```\nTo run the code, call\n```\npython run_agent.py --model [path to .model file] --weights [path to .weight file]\n```\nAfter loading up, you should see a window of the agent playing Minecraft.\n# Agent Model Zoo\nBelow are the model files and weights files for various pre-trained Minecraft models.\nThe 1x, 2x and 3x model files correspond to their respective model weights width."
        },
        {
            "comment": "This code provides links to download pre-trained models for Minecraft reinforcement learning, trained using behavioral cloning on video demonstrations. Foundational models are trained across all videos in a single training run, while house and early game models refine further with specific data sets.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":36-50",
            "content": "* [:arrow_down: 1x Model](https://openaipublic.blob.core.windows.net/minecraft-rl/models/foundation-model-1x.model)\n* [:arrow_down: 2x Model](https://openaipublic.blob.core.windows.net/minecraft-rl/models/2x.model)\n* [:arrow_down: 3x Model](https://openaipublic.blob.core.windows.net/minecraft-rl/models/foundation-model-3x.model)\n### Demonstration Only - Behavioral Cloning\nThese models are trained on video demonstrations of humans playing Minecraft\nusing behavioral cloning (BC) and are more general than later models which\nuse reinforcement learning (RL) to further optimize the policy.\nFoundational models are trained across all videos in a single training run\nwhile house and early game models refine their respective size foundational\nmodel further using either the housebuilding contractor data or early game video\nsub-set. See the paper linked above for more details.\n#### Foundational Model :chart_with_upwards_trend:\n  * [:arrow_down: 1x Width Weights](https://openaipublic.blob.core.windows.net/minecraft-rl/models/foundation-model-1x.weights)"
        },
        {
            "comment": "This code provides links to pre-trained models for Minecraft gameplay and mentions fine-tuned models from specific starting points. Additionally, it introduces models with environment interactions that are trained using a reward function aimed at obtaining diamond pickaxes.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":51-64",
            "content": "  * [:arrow_down: 2x Width Weights](https://openaipublic.blob.core.windows.net/minecraft-rl/models/foundation-model-2x.weights)\n  * [:arrow_down: 3x Width Weights](https://openaipublic.blob.core.windows.net/minecraft-rl/models/foundation-model-3x.weights)\n#### Fine-Tuned from House :chart_with_upwards_trend:\n  * [:arrow_down: 3x Width Weights](https://openaipublic.blob.core.windows.net/minecraft-rl/models/bc-house-3x.weights)\n#### Fine-Tuned from Early Game :chart_with_upwards_trend:\n  * [:arrow_down: 2x Width Weights](https://openaipublic.blob.core.windows.net/minecraft-rl/models/bc-early-game-2x.weights)\n  * [:arrow_down: 3x Width Weights](https://openaipublic.blob.core.windows.net/minecraft-rl/models/bc-early-game-3x.weights)\n### Models With Environment Interactions\nThese models further refine the above demonstration based models with a reward\nfunction targeted at obtaining diamond pickaxes. While less general then the behavioral\ncloning models, these models have the benefit of interacting with the environment"
        },
        {
            "comment": "This code provides pre-trained models for Minecraft gameplay using reinforcement learning and an Inverse Dynamics Model (IDM). The models are trained with different reward functions and excel at progressing quickly through the tech tree. Users can download the models and weights from specified URLs to run the IDM, which predicts player actions in a video recording.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":65-84",
            "content": "using a reward function and excel at progressing through the tech tree quickly.\nSee the paper for more information\non how they were trained and the exact reward schedule.\n#### RL from Foundation :chart_with_upwards_trend:\n  * [:arrow_down: 2x Width Weights](https://openaipublic.blob.core.windows.net/minecraft-rl/models/rl-from-foundation-2x.weights)\n#### RL from House :chart_with_upwards_trend:\n  * [:arrow_down: 2x Width Weights](https://openaipublic.blob.core.windows.net/minecraft-rl/models/rl-from-house-2x.weights)\n#### RL from Early Game :chart_with_upwards_trend:\n  * [:arrow_down: 2x Width Weights](https://openaipublic.blob.core.windows.net/minecraft-rl/models/rl-from-early-game-2x.weights)\n# Running Inverse Dynamics Model (IDM)\nIDM aims to predict what actions player is taking in a video recording.\nSetup:\n* Install requirements: `pip install -r requirements.txt`\n* Download the IDM model [.model :arrow_down:](https://openaipublic.blob.core.windows.net/minecraft-rl/idm/4x_idm.model) and [.weight :arrow_down:](https://openaipublic.blob.core.windows.net/minecraft-rl/idm/4x_idm.weights) files"
        },
        {
            "comment": "This code provides a demonstration of the Inverse Dynamics Model (IDM) using provided contractor recordings for video and actions. The model is run with specific file paths, and a window displays the predicted and true actions side-by-side. Note that this script is designed for demonstration purposes only, not for practical implementation.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":85-98",
            "content": "* For demonstration purposes, you can use the contractor recordings shared below to. For this demo we use\n  [this .mp4](https://openaipublic.blob.core.windows.net/minecraft-rl/data/10.0/cheeky-cornflower-setter-02e496ce4abb-20220421-092639.mp4)\n  and [this associated actions file (.jsonl)](https://openaipublic.blob.core.windows.net/minecraft-rl/data/10.0/cheeky-cornflower-setter-02e496ce4abb-20220421-092639.jsonl).\nTo run the model with above files placed in the root directory of this code:\n```\npython run_inverse_dynamics_model.py -weights 4x_idm.weights --model 4x_idm.model --video-path cheeky-cornflower-setter-02e496ce4abb-20220421-092639.mp4 --jsonl-path cheeky-cornflower-setter-02e496ce4abb-20220421-092639.jsonl\n```\nA window should pop up which shows the video frame-by-frame, showing the predicted and true (recorded) actions side-by-side on the left.\nNote that `run_inverse_dynamics_model.py` is designed to be a demo of the IDM, not code to put it into practice.\n# Using behavioural cloning to fine-tune the models"
        },
        {
            "comment": "This code is a demonstration of video pre-training using behavioral cloning. It requires installing dependencies, downloading model and data files, and then fine-tuning the model with custom weights for better performance.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":100-113",
            "content": "**Disclaimer:** This code is a rough demonstration only and not an exact recreation of what original VPT paper did (but it contains some preprocessing steps you want to be aware of)! As such, do not expect replicate the original experiments with this code. This code has been designed to be run-able on consumer hardware (e.g., 8GB of VRAM).\nSetup:\n* Install requirements: `pip install -r requirements.txt`\n* Download `.weights` and `.model` file for model you want to fine-tune.\n* Download contractor data (below) and place the `.mp4` and `.jsonl` files to the same directory (e.g., `data`). With default settings, you need at least 12 recordings.\nIf you downloaded the \"1x Width\" models and placed some data under `data` directory, you can perform finetuning with\n```\npython behavioural_cloning.py --data-dir data --in-model foundation-model-1x.model --in-weights foundation-model-1x.weights --out-weights finetuned-1x.weights\n```\nYou can then use `finetuned-1x.weights` when running the agent. You can change the training settings at the top of `behavioural_cloning.py`."
        },
        {
            "comment": "This code is a README.md file that lists the major limitations of the pre-training, describes a contractor demonstrations section, and provides details about the versions used for this project. It also mentions how different versions were used to change modalities or prompt changes due to contractor's internal questions and clarifications.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":115-135",
            "content": "Major limitations:\n- Only trains single step at the time, i.e., errors are not propagated through timesteps.\n- Computes gradients one sample at a time to keep memory use low, but also slows down the code.\n# Contractor Demonstrations\n### Versions\nOver the course of the project we requested various demonstrations from contractors\nwhich we release as index files below. In general, major recorder versions change for a new\nprompt or recording feature while bug-fixes were represented as minor version changes.\nHowever, some\nrecorder versions we asked contractors to change their username when recording particular\nmodalities. Also, as contractors internally ask questions, clarification from one contractor may\nresult in a behavioral change in the other contractor. It is intractable to share every contractor's\nview for each version, but we've shared the prompts and major clarifications for each recorder\nversion where the task changed significantly.\n  <details>\n  <summary>Initial Prompt</summary>\n  We are collect"
        },
        {
            "comment": "This code is a list of available versions for the Minecraft AI model training program. It includes a description of the features in each version and provides links to download the modified Minecraft version for training.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":135-151",
            "content": "ing data for training AI models in Minecraft. You'll need to install java, download the modified version of minecraft (that collects and uploads your play data), and play minecraft survival mode! Paid per hour of gameplay. Prior experience in minecraft not. necessary. We do not collect any data that is unrelated to minecraft from your computer.\n  </details>\nThe following is a list of the available versions:\n* **6.x** Core recorder features subject to change [:arrow_down: index file](https://openaipublic.blob.core.windows.net/minecraft-rl/snapshots/all_6xx_Jun_29.json)\n  * 6.9 First feature complete recorder version\n  * 6.10 Fixes mouse scaling on Mac when gui is open\n  * 6.11 Tracks the hotbar slot\n  * 6.13 Sprinting, swap-hands, ... (see commits below)\n    <details>\n    <summary>Commits</summary>\n    * improve replays that are cut in the middle of gui; working on riding boats / replays cut in the middle of a run\n    * improve replays by adding dwheel action etc, also, loosen up replay tolerances\n    * opencv version bump"
        },
        {
            "comment": "This code seems to be part of a README file for a Minecraft-based reinforcement learning project. The comments suggest that the developers are working on various features such as swapping hands and implementing replaying from running and sprinting. They also mention not recording sprinting data, checking for mouse button numbers, and handling errors related to recording mouse or keyboard input as null. Additionally, there is a note about prompting contractors to collect early game data (first 30 minutes) in newer worlds to help improve the AI's performance in those stages of the game.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":152-167",
            "content": "    * add swap hands, and recording of the step timestamp\n    * implement replaying from running and sprinting and tests\n    * do not record sprinting (can use stats for that)\n    * check for mouse button number, ignore >2\n    * handle the errors when mouse / keyboard are recorded as null\n    </details>\n* **7.x** Prompt changes [:arrow_down: index file](https://openaipublic.blob.core.windows.net/minecraft-rl/snapshots/all_7xx_Apr_6.json)\n  * 7.6 Bump version for internal tracking\n    <details>\n    <summary>Additional ask to contractors</summary>\n    Right now, early game data is especially valuable to us. As such, we request that at least half of the data you upload is from the first 30 minutes of the game. This means that, for every hour of gameplay you spend in an older world, we ask you to play two sessions in which you create a new world and play for 30 minutes. You can play for longer in these worlds, but only the first 30 minutes counts as early game data.\n    </details>\n* **8.x** :clipboard"
        },
        {
            "comment": "This code is providing instructions for a new task, \"Building a Simple House\". The task involves building a house using primarily wood, dirt, and sand, along with crafted wood items. The structure can be decorated as desired but should not use difficult materials such as stone. It also provides information about the need to update the recording script and use a new world each time.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":167-181",
            "content": ": House Building from Scratch Task [:arrow_down: index](https://openaipublic.blob.core.windows.net/minecraft-rl/snapshots/all_8xx_Jun_29.json)\n  <details>\n  <summary>Changes and Prompt</summary>\n  Hi all! Thank you for your hard work so far.\n  This week we would like to have you all collect data on a specific task.\n  This comes with a new recorder version 8.0 which you will need to update your recording script to download.\n  This week we would like you to use a new world each time you play, so loading existing worlds is disabled.\n  The new task is as follows:\n  Starting in a new world, build a simple house in 10-15 minutes. This corresponds to one day and a bit of the night. Please use primarily wood, dirt, and sand, as well as crafted wood items such as doors, fences, ect. in constructing your house. Avoid using difficult items such as stone. Aside from those constraints, you may decorate the structure you build as you wish. It does not need to have any specific furniture. For example, it is "
        },
        {
            "comment": "This code is for a Minecraft demonstration task where the player must build a house within 20 minutes. If not finished, they should exit and continue with another demo. Narration is required throughout. The demonstrations need to be completed in one session without resuming after exiting or going back to the main menu. Save files will be saved locally for viewing later but may be used for future tasks if space permits. The task requires a simple house without sleep areas and avoids cobblestone, stone, and granite. Stone tools are acceptable but time-limited. The episode ends after 10 realtime minutes. World names follow the format \"build-house-15-min-\" + random number.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":181-193",
            "content": "OK if there is no bed in your house. If you have not finished the house by the sunrise (20 minutes) please exit and continue to another demonstration. Please continue to narrate what you are doing while completing this task.\n  Since you will be unable to resume building after exiting Minecraft or going back to the main menu, you must finish these demonstrations in one session. Pausing via the menu is still supported. If you want to view your creations later, they will be saved locally so you can look at them in your own time. We may use these save files in a future task so if you have space, please leave the save files titled “build-house-15-min-“.\n  For this week try to avoid all cobblestone / stone / granite\n  For this week we just want simple houses without sleeping. If 10 minutes is too short, let us know and we can think of how to adjust!\n  Stone tools are ok but I think you may run-out of time\n  Changes:\n    * Timer ends episode after 10 realtime minutes\n    * Worlds are named: `\"build-house-15-min-\" + Math.abs(random.nextInt());`"
        },
        {
            "comment": "Introduces 10-minute timer for task completion.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":195-214",
            "content": "  </details>\n  * Note this version introduces 10-minute timer that ends the episode. It\n  cut experiments short occasionally and was fixed in 9.1\n  * 8.0 Simple House\n  * 8.2 Update upload script\n* **9.x** :clipboard: House Building from Random Starting Materials Task [:arrow_down: index](https://openaipublic.blob.core.windows.net/minecraft-rl/snapshots/all_9xx_Jun_29.json)\n    <details>\n    <summary>Changes and Prompt</summary>\n    You now will have 10 minutes to use the provided resources to build your house / home / or structure. In this version, the experiment will time out after 10 minutes if you are not complete so don't be alarmed if that happens, it is intentional.\n    No need to use up all the resources! It's ok to collect a few things but spend the majority of the time placing blocks (the act of placing seems to be harder to learn)\n    Changes:\n    * Worlds are named: `\"design-house-10-min-\" + Math.abs(random.nextInt());`\n    * Starting inventory given by code below\n    </details>\n    <details>"
        },
        {
            "comment": "This code generates a random starting inventory for the player by adding basic tools, some random items, and building blocks to their hotbar and inventory.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":215-236",
            "content": "    <summary>Random Starting Inventory Code</summary>\n  ```java\n        Random random = new Random();\n        List<ItemStack> hotbar = new ArrayList<>();\n        List<ItemStack> inventory = new ArrayList<>();\n        // Ensure we give the player the basic tools in their hot bar\n        hotbar.add(new ItemStack(Items.STONE_AXE));\n        hotbar.add(new ItemStack(Items.STONE_PICKAXE));\n        hotbar.add(new ItemStack(Items.STONE_SHOVEL));\n        hotbar.add(new ItemStack(Items.CRAFTING_TABLE));\n        // Add some random items to the player hotbar as well\n        addToList(hotbar, inventory, Items.TORCH, random.nextInt(16) * 2 + 2);\n        // Next add main building blocks\n        if (random.nextFloat() < 0.7) {\n           addToList(hotbar, inventory, Items.OAK_FENCE_GATE, random.nextInt(5));\n           addToList(hotbar, inventory, Items.OAK_FENCE, random.nextInt(5) * 64);\n           addToList(hotbar, inventory, Items.OAK_DOOR, random.nextInt(5));\n           addToList(hotbar, inventory, Items.OAK_TRAPDOOR, random.nextInt(2) * 2);"
        },
        {
            "comment": "This code randomly selects items to add to the hotbar based on the type of biome the player is in. It uses different lists of items for oak and birch biomes.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":237-249",
            "content": "           addToList(hotbar, inventory, Items.OAK_PLANKS, random.nextInt(3) * 64 + 128);\n           addToList(hotbar, inventory, Items.OAK_SLAB, random.nextInt(3) * 64);\n           addToList(hotbar, inventory, Items.OAK_STAIRS, random.nextInt(3) * 64);\n           addToList(hotbar, inventory, Items.OAK_LOG, random.nextInt(2) * 32);\n           addToList(hotbar, inventory, Items.OAK_PRESSURE_PLATE, random.nextInt(5));\n        } else {\n           addToList(hotbar, inventory, Items.BIRCH_FENCE_GATE, random.nextInt(5));\n           addToList(hotbar, inventory, Items.BIRCH_FENCE, random.nextInt(5) * 64);\n           addToList(hotbar, inventory, Items.BIRCH_DOOR, random.nextInt(5));\n           addToList(hotbar, inventory, Items.BIRCH_TRAPDOOR, random.nextInt(2) * 2);\n           addToList(hotbar, inventory, Items.BIRCH_PLANKS, random.nextInt(3) * 64 + 128);\n           addToList(hotbar, inventory, Items.BIRCH_SLAB, random.nextInt(3) * 64);\n           addToList(hotbar, inventory, Items.BIRCH_STAIRS, random.nextInt(3) * 64);"
        },
        {
            "comment": "This code is adding a variety of items to the player's inventory. It uses random number generation to decide how many of each item to add, with some items having a higher chance of appearing than others (e.g., beds have a 20% chance). This helps create a diverse and unpredictable inventory for the player to work with.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":250-262",
            "content": "           addToList(hotbar, inventory, Items.BIRCH_LOG, random.nextInt(2) * 32);\n           addToList(hotbar, inventory, Items.BIRCH_PRESSURE_PLATE, random.nextInt(5));\n        }\n        // Now add some random decoration items to the player inventory\n        addToList(hotbar, inventory, Items.CHEST, random.nextInt(3));\n        addToList(hotbar, inventory, Items.FURNACE, random.nextInt(2) + 1);\n        addToList(hotbar, inventory, Items.GLASS_PANE,  random.nextInt(5) * 4);\n        addToList(hotbar, inventory, Items.WHITE_BED, (int) (random.nextFloat() + 0.2)); // Bed 20% of the time\n        addToList(hotbar, inventory, Items.PAINTING, (int) (random.nextFloat() + 0.1)); // Painting 10% of the time\n        addToList(hotbar, inventory, Items.FLOWER_POT, (int) (random.nextFloat() + 0.1) * 4); // 4 Flower pots 10% of the time\n        addToList(hotbar, inventory, Items.OXEYE_DAISY, (int) (random.nextFloat() + 0.1) * 4); // 4 Oxeye daisies 10% of the time\n        addToList(hotbar, inventory, Items.POPPY, (int) (random.nextFloat() + 0.1) * 4); // 4 Poppies 10% of the time"
        },
        {
            "comment": "This code adds 4 sunflowers to the player's inventory 10% of the time, shuffles both the hotbar and inventory slots, and then gives the player the items if they are the same as the current player.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":263-287",
            "content": "        addToList(hotbar, inventory, Items.SUNFLOWER, (int) (random.nextFloat() + 0.1) * 4); // 4 Sunflowers 10% of the time\n        // Shuffle the hotbar slots and inventory slots\n        Collections.shuffle(hotbar);\n        Collections.shuffle(inventory);\n        // Give the player the items\n        this.mc.getIntegratedServer().getPlayerList().getPlayers().forEach(p -> {\n           if (p.getUniqueID().equals(this.getUniqueID())) {\n               hotbar.forEach(p.inventory::addItemStackToInventory);\n               inventory.forEach(p.inventory::addItemStackToInventory);\n           }\n        });\n  ```\n    </details>\n     * 9.0 First version\n     * 9.1 Fixed timer bug\n* **10.0** :clipboard: Obtain Diamond Pickaxe Task [:arrow_down: index](https://openaipublic.blob.core.windows.net/minecraft-rl/snapshots/all_10xx_Jun_29.json)\n  <details>\n  <summary>Changes and Prompt</summary>\n  Prompt:\n  For this new task we have given you 20 minutes to craft a diamond pickaxe. We ask that you do not try to search for vi"
        },
        {
            "comment": "Code discusses time limits for finding diamonds in Minecraft, changing version numbers, and requesting contractors to chop trees while recording gameplay with a specific username.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":287-303",
            "content": "llages or other ways of getting diamonds, but if you are spawned in view of one, or happen to fall into a cave structure feel free to explore it for diamonds.\n  If 20 min is not enough that is OK. It will happen on some seeds because of bad luck. Please do not use glitches to find the diamonds.\n  Changes:\n  * change to 20 minute time limit\n  * _don't count gui time as part of the time limit_\n  * World are named `\"collect-diamond-pickaxe-15min-\" + Math.abs(random.nextInt());`\n  </details>\nSometimes we asked the contractors to signify other tasks besides changing the version. This\nprimarily occurred in versions 6 and 7 as 8, 9 and 10 are all task specific.\n<details>\n<summary>Prompt to contractors (click to show)</summary>\nAnother request about additional time - please use some of it to chop trees. Specifically, please start the recorder by adding --username treechop argument to the script (i.e. use play --username treechop on windows, ./play.sh --username treechop on osx/linux), and spend some time"
        },
        {
            "comment": "The code is providing instructions for the video game Minecraft, asking testers to spend a portion of their time chopping trees and using easily obtainable tools in a new world. It also mentions restrictions on the contractor's environment, such as windowed mode, downsampling, and disabling options like brightness and rendering settings.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":303-310",
            "content": " chopping trees! Getting wooden or stone tools is ok, but please spend the majority of the with username treechop specifically chopping. I did it myself for about 15 minutes, and it does get boring pretty quickly, so I don't expect you to do it all the time, but please do at least a little bit of chopping. Feel free to play normally the rest of the time (but please restart without --username treechop argument when you are not chopping)\nHowever, it is preferable that you start a new world though, and use only the tools that are easily obtainable in that world. I'll see what I can do about getting player an iron axe - that sounds reasonable, and should not be hard, but will require a code update.\n</details>\n### Environment\nWe restrict the contractors to playing Minecraft in windowed mode at 720p which we downsample at 20hz to 360p\nto minimize space. We also disabled the options screen to prevent the contractor from\nchanging things such as brightness, or rendering options. We ask contractors not to press keys"
        },
        {
            "comment": "The code provides information about the format of demonstrations, which are broken into 5-minute segments containing compressed screen observations, actions, environment statistics, and checkpoint save files. It also mentions that there may be missing chunks from continuous demonstrations due to network errors. The index files for each version are provided as JSON files with a list of relative paths following a specific format.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":311-337",
            "content": "such as f3 which shows a debug overlay, however some contractors may still do this.\n### Data format\nDemonstrations are broken up into up to 5 minute segments consisting of a series of\ncompressed screen observations, actions, environment statistics, and a checkpoint\nsave file from the start of the segment. Each relative path in the index will\nhave all the files for that given segment, however if a file was dropped while\nuploading, the corresponding relative path is not included in the index therefore\nthere may be missing chunks from otherwise continuous demonstrations.\nIndex files are provided for each version as a json file:\n```json\n{\n  \"basedir\": \"https://openaipublic.blob.core.windows.net/data/\",\n  \"relpaths\": [\n    \"8.0/cheeky-cornflower-setter-74ae6c2eae2e-20220315-122354\",\n    ...\n  ]\n}\n```\nRelative paths follow the following format:\n* `<recorder-version>/<contractor-alias>-<session-id>-<date>-<time>`\n> Note that due to network errors, some segments may be missing from otherwise\ncontinuous demonstrations."
        },
        {
            "comment": "The code defines the structure of files required by the data loader, including video observation file, action file, options file, and checkpoint save file. The action file contains a list of individual action dictionaries in JSON format, each representing mouse and keyboard inputs, game status, player position, and inventory for a specific tick or frame.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":339-387",
            "content": "Your data loader can then find following files:\n* Video observation: `<basedir>/<relpath>.mp4`\n* Action file: `<basedir>/<relpath>.jsonl`\n* Options file: `<basedir>/<relpath>-options.json`\n* Checkpoint save file: `<basedir>/<relpath>.zip`\nThe action file is **not**  a valid json object: each line in\naction file is an individual action dictionary.\nFor v7.x, the actions are in form\n```json\n{\n  \"mouse\": {\n    \"x\": 274.0,\n    \"y\": 338.0,\n    \"dx\": 0.0,\n    \"dy\": 0.0,\n    \"scaledX\": -366.0,\n    \"scaledY\": -22.0,\n    \"dwheel\": 0.0,\n    \"buttons\": [],\n    \"newButtons\": []\n  },\n  \"keyboard\": {\n    \"keys\": [\n      \"key.keyboard.a\",\n      \"key.keyboard.s\"\n    ],\n    \"newKeys\": [],\n    \"chars\": \"\"\n  },\n  \"isGuiOpen\": false,\n  \"isGuiInventory\": false,\n  \"hotbar\": 4,\n  \"yaw\": -112.35006,\n  \"pitch\": 8.099996,\n  \"xpos\": 841.364694513396,\n  \"ypos\": 63.0,\n  \"zpos\": 24.956354839537802,\n  \"tick\": 0,\n  \"milli\": 1649575088006,\n  \"inventory\": [\n    {\n      \"type\": \"oak_door\",\n      \"quantity\": 3\n    },\n    {\n      \"type\": \"oak_planks\",\n      \"quantity\": 59"
        },
        {
            "comment": "This code represents a JSON object containing game state information and player actions for Minecraft. It includes a list of items in the player's inventory, server tick data, and various statistics tracking the player's actions. The dataset is collected for the MineRL BASALT 2022 competition with around 150GB of data per task.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":388-417",
            "content": "    },\n    {\n      \"type\": \"stone_pickaxe\",\n      \"quantity\": 1\n    },\n    {\n      \"type\": \"oak_planks\",\n      \"quantity\": 64\n    }\n  ],\n  \"serverTick\": 6001,\n  \"serverTickDurationMs\": 36.3466,\n  \"stats\": {\n    \"minecraft.custom:minecraft.jump\": 4,\n    \"minecraft.custom:minecraft.time_since_rest\": 5999,\n    \"minecraft.custom:minecraft.play_one_minute\": 5999,\n    \"minecraft.custom:minecraft.time_since_death\": 5999,\n    \"minecraft.custom:minecraft.walk_one_cm\": 7554,\n    \"minecraft.use_item:minecraft.oak_planks\": 5,\n    \"minecraft.custom:minecraft.fall_one_cm\": 269,\n    \"minecraft.use_item:minecraft.glass_pane\": 3\n  }\n}\n```\n# BASALT 2022 dataset\nWe also collected a dataset of demonstrations for the [MineRL BASALT 2022](https://www.aicrowd.com/challenges/neurips-2022-minerl-basalt-competition) competition, with around 150GB of data per task.\n**Note**: To avoid confusion with the competition rules, the action files (.jsonl) have been stripped of information that is not allowed in the competition. We will upload unmodified dataset after the competition ends."
        },
        {
            "comment": "FindCave: Look for a cave and quit the game when inside one. No digging from surface. Timelimit: 3 minutes. Example recordings: https://www.youtube.com/watch?v=TclP_ozH-eg\n\nMakeWaterfall: Spawn in mountainous area, build waterfall, take a scenic picture, and quit the game. Timelimit: 5 minutes.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":419-438",
            "content": "* **FindCave** [:arrow_down: index file](https://openaipublic.blob.core.windows.net/minecraft-rl/snapshots/find-cave-Jul-28.json)\n  * <details>\n    <summary>Prompt to contractors (click to show)</summary>\n    ```\n    Look around for a cave. When you are inside one, quit the game by opening main menu and pressing \"Save and Quit To Title\".\n    You are not allowed to dig down from the surface to find a cave.\n    Timelimit: 3 minutes.\n    Example recordings: https://www.youtube.com/watch?v=TclP_ozH-eg\n    ```\n    </details>\n* **MakeWaterfall** [:arrow_down: index file](https://openaipublic.blob.core.windows.net/minecraft-rl/snapshots/waterfall-Jul-28.json)\n  * <details>\n    <summary>Prompt to contractors (click to show)</summary>\n    ```\n    After spawning in a mountainous area with a water bucket and various tools, build a beautiful waterfall and then reposition yourself to “take a scenic picture” of the same waterfall, and then quit the game by opening the menu and selecting \"Save and Quit to Title\"\n    Timelimit: 5 minutes."
        },
        {
            "comment": "This code provides a prompt for contractors to build an animal pen next to a village house using specific animals and materials, without harming the village.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":439-450",
            "content": "    Example recordings: https://youtu.be/NONcbS85NLA\n    ```\n    </details>\n* **MakeVillageAnimalPen** [:arrow_down: index file](https://openaipublic.blob.core.windows.net/minecraft-rl/snapshots/pen-animals-Jul-28.json)\n  * <details>\n    <summary>Prompt to contractors (click to show)</summary>\n    ```\n    After spawning in a village, build an animal pen next to one of the houses in a village. Use your fence posts to build one animal pen that contains at least two of the same animal. (You are only allowed to pen chickens, cows, pigs, sheep or rabbits.) There should be at least one gate that allows players to enter and exit easily. The animal pen should not contain more than one type of animal. (You may kill any extra types of animals that accidentally got into the pen.) Don’t harm the village.\n    After you are done, quit the game by opening the menu and pressing \"Save and Quit to Title\".\n    You may need to terraform the area around a house to build a pen. When we say not to harm the village, e"
        },
        {
            "comment": "The code describes tasks for AI to complete in the game of Minecraft. Tasks include not harming animals or damaging existing structures while building a new house, and giving a brief tour of the constructed house. There is also a time limit of 5 minutes and an example recording provided for reference.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":450-466",
            "content": "xamples include taking animals from existing pens, damaging existing houses or farms, and attacking villagers. Animal pens must have a single type of animal: pigs, cows, sheep, chicken or rabbits.\n    The food items can be used to lure in the animals: if you hold seeds in your hand, this attracts nearby chickens to you, for example.\n    Timelimit: 5 minutes.\n    Example recordings: https://youtu.be/SLO7sep7BO8\n    ```\n    </details>\n* **BuildVillageHouse** [:arrow_down: index file](https://openaipublic.blob.core.windows.net/minecraft-rl/snapshots/build-house-Jul-28.json)\n  * <details>\n    <summary>Prompt to contractors (click to show)</summary>\n    ```\n    Taking advantage of the items in your inventory, build a new house in the style of the village (random biome), in an appropriate location (e.g. next to the path through the village), without harming the village in the process.\n    Then give a brief tour of the house (i.e. spin around slowly such that all of the walls and the roof are visible).\n "
        },
        {
            "comment": "Instructions for building a house in Minecraft within 10 minutes, without causing harm to the village.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":466-486",
            "content": "   * You start with a stone pickaxe and a stone axe, and various building blocks. It’s okay to break items that you misplaced (e.g. use the stone pickaxe to break cobblestone blocks).\n    * You are allowed to craft new blocks.\n    Please spend less than ten minutes constructing your house.\n    You don’t need to copy another house in the village exactly (in fact, we’re more interested in having slight deviations, while keeping the same \"style\"). You may need to terraform the area to make space for a new house.\n    When we say not to harm the village, examples include taking animals from existing pens, damaging existing houses or farms, and attacking villagers.\n    After you are done, quit the game by opening the menu and pressing \"Save and Quit to Title\".\n    Timelimit: 12 minutes.\n    Example recordings: https://youtu.be/WeVqQN96V_g\n    ```\n    </details>\n# Contribution\nThis was a large effort by a dedicated team at OpenAI:\n[Bowen Baker](https://github.com/bowenbaker),\n[Ilge Akkaya](https://github.com/ilge),"
        },
        {
            "comment": "This code is acknowledging the authors of the model and crediting Anssi Kanervisto for preparing a minimal version of the code to be used in the MineRL BASALT competition.",
            "location": "\"/media/root/Toshiba XG3/works/Video-Pre-Training/docs/src/README.md\":487-496",
            "content": "[Peter Zhokhov](https://github.com/pzhokhov),\n[Joost Huizinga](https://github.com/JoostHuizinga),\n[Jie Tang](https://github.com/jietang),\n[Adrien Ecoffet](https://github.com/AdrienLE),\n[Brandon Houghton](https://github.com/brandonhoughton),\n[Raul Sampedro](https://github.com/samraul),\nJeff Clune\nThe code here represents a minimal version of our model code which was\nprepared by [Anssi Kanervisto](https://github.com/miffyli) and others so that these models could be used as\npart of the MineRL BASALT competition."
        }
    ]
}